[Killed] BlockStatement
src/lib/qr-utils.ts:7:54
 import type { StyleCard } from './db-schema';
 
 // Helper to convert Uint8Array to Base64 in both Node and Browser
-function uint8ArrayToBase64(arr: Uint8Array): string {
-  if (typeof Buffer !== 'undefined') {
-    return Buffer.from(arr).toString('base64');
-  }
-  let binary = '';
-  const len = arr.byteLength;
-  for (let i = 0; i < len; i++) {
-    binary += String.fromCharCode(arr[i]);
-  }
-  return btoa(binary);
-}
+function uint8ArrayToBase64(arr: Uint8Array): string {}
 
 // Helper to convert Base64 to Uint8Array in both Node and Browser
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Survived] ConditionalExpression
src/lib/qr-utils.ts:8:7
 
 // Helper to convert Uint8Array to Base64 in both Node and Browser
 function uint8ArrayToBase64(arr: Uint8Array): string {
-  if (typeof Buffer !== 'undefined') {
+  if (true) {
     return Buffer.from(arr).toString('base64');
   }

[Survived] BlockStatement
src/lib/qr-utils.ts:8:38
 
 // Helper to convert Uint8Array to Base64 in both Node and Browser
 function uint8ArrayToBase64(arr: Uint8Array): string {
-  if (typeof Buffer !== 'undefined') {
-    return Buffer.from(arr).toString('base64');
-  }
+  if (typeof Buffer !== 'undefined') {}
   let binary = '';
   const len = arr.byteLength;

[Killed] StringLiteral
src/lib/qr-utils.ts:9:38
 // Helper to convert Uint8Array to Base64 in both Node and Browser
 function uint8ArrayToBase64(arr: Uint8Array): string {
   if (typeof Buffer !== 'undefined') {
-    return Buffer.from(arr).toString('base64');
+    return Buffer.from(arr).toString("");
   }
   let binary = '';
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: Unknown encoding:

[NoCoverage] StringLiteral
src/lib/qr-utils.ts:11:16
   if (typeof Buffer !== 'undefined') {
     return Buffer.from(arr).toString('base64');
   }
-  let binary = '';
+  let binary = "Stryker was here!";
   const len = arr.byteLength;
   for (let i = 0; i < len; i++) {

[NoCoverage] ConditionalExpression
src/lib/qr-utils.ts:13:19
   }
   let binary = '';
   const len = arr.byteLength;
-  for (let i = 0; i < len; i++) {
+  for (let i = 0; false; i++) {
     binary += String.fromCharCode(arr[i]);
   }

[NoCoverage] EqualityOperator
src/lib/qr-utils.ts:13:19
   }
   let binary = '';
   const len = arr.byteLength;
-  for (let i = 0; i < len; i++) {
+  for (let i = 0; i >= len; i++) {
     binary += String.fromCharCode(arr[i]);
   }

[NoCoverage] AssignmentOperator
src/lib/qr-utils.ts:14:5
   let binary = '';
   const len = arr.byteLength;
   for (let i = 0; i < len; i++) {
-    binary += String.fromCharCode(arr[i]);
+    binary -= String.fromCharCode(arr[i]);
   }
   return btoa(binary);

[Killed] BlockStatement
src/lib/qr-utils.ts:20:57
 }
 
 // Helper to convert Base64 to Uint8Array in both Node and Browser
-function base64ToUint8Array(base64: string): Uint8Array {
-  if (typeof Buffer !== 'undefined') {
-    const buf = Buffer.from(base64, 'base64');
-    return new Uint8Array(buf.buffer, buf.byteOffset, buf.byteLength);
-  }
-  const binaryString = atob(base64);
-  const len = binaryString.length;
-  const bytes = new Uint8Array(len);
-  for (let i = 0; i < len; i++) {
-    bytes[i] = binaryString.charCodeAt(i);
-  }
-  return bytes;
-}
+function base64ToUint8Array(base64: string): Uint8Array {}
 
 /**
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: Invalid QR payload or compression error

[Survived] BlockStatement
src/lib/qr-utils.ts:21:38
 
 // Helper to convert Base64 to Uint8Array in both Node and Browser
 function base64ToUint8Array(base64: string): Uint8Array {
-  if (typeof Buffer !== 'undefined') {
-    const buf = Buffer.from(base64, 'base64');
-    return new Uint8Array(buf.buffer, buf.byteOffset, buf.byteLength);
-  }
+  if (typeof Buffer !== 'undefined') {}
   const binaryString = atob(base64);
   const len = binaryString.length;

[Survived] EqualityOperator
src/lib/qr-utils.ts:21:7
 
 // Helper to convert Base64 to Uint8Array in both Node and Browser
 function base64ToUint8Array(base64: string): Uint8Array {
-  if (typeof Buffer !== 'undefined') {
+  if (typeof Buffer === 'undefined') {
     const buf = Buffer.from(base64, 'base64');
     return new Uint8Array(buf.buffer, buf.byteOffset, buf.byteLength);

[NoCoverage] EqualityOperator
src/lib/qr-utils.ts:28:19
   const binaryString = atob(base64);
   const len = binaryString.length;
   const bytes = new Uint8Array(len);
-  for (let i = 0; i < len; i++) {
+  for (let i = 0; i <= len; i++) {
     bytes[i] = binaryString.charCodeAt(i);
   }

[NoCoverage] BlockStatement
src/lib/qr-utils.ts:28:33
   const binaryString = atob(base64);
   const len = binaryString.length;
   const bytes = new Uint8Array(len);
-  for (let i = 0; i < len; i++) {
-    bytes[i] = binaryString.charCodeAt(i);
-  }
+  for (let i = 0; i < len; i++) {}
   return bytes;
 }

[Killed] ConditionalExpression
src/lib/qr-utils.ts:40:7
  */
 export function compressCardData(card: StyleCard): string {
   const parameters = { ...card.parameters };
-  if (card.masking?.isSrefHidden) {
+  if (false) {
     delete parameters.sref;
   }
killedBy: qr-utils compressCardData and decompressCardData should respect masking configuration and delete hidden parameters during compression
statusReason: expected [ Array(1) ] to be undefined

[Killed] ConditionalExpression
src/lib/qr-utils.ts:40:7
  */
 export function compressCardData(card: StyleCard): string {
   const parameters = { ...card.parameters };
-  if (card.masking?.isSrefHidden) {
+  if (true) {
     delete parameters.sref;
   }
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: expected { ar: '16:9', stylize: 250, raw: true } to deeply equal { ar: '16:9', …(3) }

[Killed] BlockStatement
src/lib/qr-utils.ts:43:32
   if (card.masking?.isSrefHidden) {
     delete parameters.sref;
   }
-  if (card.masking?.isPHidden) {
-    delete parameters.p;
-  }
+  if (card.masking?.isPHidden) {}
 
   const cleanCard = {
killedBy: qr-utils compressCardData and decompressCardData should respect masking configuration and delete hidden parameters during compression
statusReason: expected [ 'personalization-code-123' ] to be undefined

[Killed] ConditionalExpression
src/lib/qr-utils.ts:43:7
   if (card.masking?.isSrefHidden) {
     delete parameters.sref;
   }
-  if (card.masking?.isPHidden) {
+  if (false) {
     delete parameters.p;
   }
killedBy: qr-utils compressCardData and decompressCardData should respect masking configuration and delete hidden parameters during compression
statusReason: expected [ 'personalization-code-123' ] to be undefined

[Killed] ConditionalExpression
src/lib/qr-utils.ts:55:15
     tier: card.tier,
     frameId: card.frameId,
     category: card.category,
-    imageUrl: card.images?.[0] || card.selectedThumbnails?.[0] || '',
+    imageUrl: false,
     accentColor: card.accentColor,
     dominantColor: card.dominantColor,
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/lib/qr-utils.ts:55:15
     tier: card.tier,
     frameId: card.frameId,
     category: card.category,
-    imageUrl: card.images?.[0] || card.selectedThumbnails?.[0] || '',
+    imageUrl: false || '',
     accentColor: card.accentColor,
     dominantColor: card.dominantColor,
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/lib/qr-utils.ts:72:37
 export function decompressCardData(payload: string): Partial<StyleCard> {
   try {
     let base64Data = payload;
-    if (payload.includes('?data=')) {
-      const match = payload.match(/[?&]data=([^&]+)/);
-      if (match && match[1]) {
-        base64Data = decodeURIComponent(match[1]);
-      }
-    }
+    if (payload.includes('?data=')) {}
     const compressedBytes = base64ToUint8Array(base64Data);
     const decompressedBytes = inflateSync(compressedBytes);
killedBy: qr-utils compressCardData and decompressCardData should decompress card data from custom protocol URL formats
statusReason: Invalid QR payload or compression error

[Killed] ConditionalExpression
src/lib/qr-utils.ts:72:9
 export function decompressCardData(payload: string): Partial<StyleCard> {
   try {
     let base64Data = payload;
-    if (payload.includes('?data=')) {
+    if (false) {
       const match = payload.match(/[?&]data=([^&]+)/);
       if (match && match[1]) {
killedBy: qr-utils compressCardData and decompressCardData should decompress card data from custom protocol URL formats
statusReason: Invalid QR payload or compression error

[Killed] Regex
src/lib/qr-utils.ts:73:35
   try {
     let base64Data = payload;
     if (payload.includes('?data=')) {
-      const match = payload.match(/[?&]data=([^&]+)/);
+      const match = payload.match(/[?&]data=([&]+)/);
       if (match && match[1]) {
         base64Data = decodeURIComponent(match[1]);
killedBy: qr-utils compressCardData and decompressCardData should decompress card data from custom protocol URL formats
statusReason: Invalid QR payload or compression error

[Killed] ConditionalExpression
src/lib/qr-utils.ts:74:11
     let base64Data = payload;
     if (payload.includes('?data=')) {
       const match = payload.match(/[?&]data=([^&]+)/);
-      if (match && match[1]) {
+      if (false) {
         base64Data = decodeURIComponent(match[1]);
       }
killedBy: qr-utils compressCardData and decompressCardData should decompress card data from custom protocol URL formats
statusReason: Invalid QR payload or compression error

[Killed] BlockStatement
src/lib/qr-utils.ts:74:30
     let base64Data = payload;
     if (payload.includes('?data=')) {
       const match = payload.match(/[?&]data=([^&]+)/);
-      if (match && match[1]) {
-        base64Data = decodeURIComponent(match[1]);
-      }
+      if (match && match[1]) {}
     }
     const compressedBytes = base64ToUint8Array(base64Data);
killedBy: qr-utils compressCardData and decompressCardData should decompress card data from custom protocol URL formats
statusReason: Invalid QR payload or compression error

[Killed] ConditionalExpression
src/lib/qr-utils.ts:96:9
       dominantColor: data.dominantColor,
     };
 
-    if (data.imageUrl) {
+    if (false) {
       card.images = [data.imageUrl];
       card.selectedThumbnails = [data.imageUrl];
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/lib/qr-utils.ts:96:24
       dominantColor: data.dominantColor,
     };
 
-    if (data.imageUrl) {
-      card.images = [data.imageUrl];
-      card.selectedThumbnails = [data.imageUrl];
-    }
+    if (data.imageUrl) {}
 
     return card;
killedBy: qr-utils compressCardData and decompressCardData should compress and decompress card data successfully, maintaining key fields
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/lib/qr-utils.ts:102:19
     }
 
     return card;
-  } catch (error) {
-    console.error('Failed to decompress card data:', error);
-    throw new Error('Invalid QR payload or compression error');
-  }
+  } catch (error) {}
 }
 
killedBy: qr-utils compressCardData and decompressCardData should throw an error when decompressing invalid data
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/lib/qr-utils.ts:104:21
     return card;
   } catch (error) {
     console.error('Failed to decompress card data:', error);
-    throw new Error('Invalid QR payload or compression error');
+    throw new Error("");
   }
 }

[Killed] BlockStatement
src/lib/qr-utils.ts:111:85
 /**
  * Generates a Data URL for a QR Code image containing the payload string.
  */
-export function generateQRCodeUrl(payload: string, width?: number): Promise<string> {
-  return QRCode.toDataURL(payload, {
-    errorCorrectionLevel: 'M', // Medium error correction is a good balance for data capacity
-    margin: 2,
-    width: width || 200,
-  });
-}
+export function generateQRCodeUrl(payload: string, width?: number): Promise<string> {}
 
 /**
killedBy: qr-utils generateQRCodeUrl should generate a QR code data URL successfully
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] ObjectLiteral
src/lib/qr-utils.ts:112:36
  * Generates a Data URL for a QR Code image containing the payload string.
  */
 export function generateQRCodeUrl(payload: string, width?: number): Promise<string> {
-  return QRCode.toDataURL(payload, {
-    errorCorrectionLevel: 'M', // Medium error correction is a good balance for data capacity
-    margin: 2,
-    width: width || 200,
-  });
+  return QRCode.toDataURL(payload, {});
 }
 

[Survived] LogicalOperator
src/lib/qr-utils.ts:115:12
   return QRCode.toDataURL(payload, {
     errorCorrectionLevel: 'M', // Medium error correction is a good balance for data capacity
     margin: 2,
-    width: width || 200,
+    width: width && 200,
   });
 }

[Survived] ConditionalExpression
src/lib/qr-utils.ts:115:12
   return QRCode.toDataURL(payload, {
     errorCorrectionLevel: 'M', // Medium error correction is a good balance for data capacity
     margin: 2,
-    width: width || 200,
+    width: true,
   });
 }

[NoCoverage] BlockStatement
src/lib/qr-utils.ts:127:26
     const reader = new FileReader();
     reader.onload = (e) => {
       const img = new Image();
-      img.onload = () => {
-        const canvas = document.createElement('canvas');
-        canvas.width = img.width;
-        canvas.height = img.height;
-        const ctx = canvas.getContext('2d');
-        if (!ctx) {
-          resolve(null);
-          return;
-        }
-        ctx.drawImage(img, 0, 0);
-        try {
-          const imageData = ctx.getImageData(0, 0, canvas.width, canvas.height);
-          const code = jsQR(imageData.data, imageData.width, imageData.height);
-          if (code) {
-            resolve(code.data);
-          } else {
-            resolve(null);
-          }
-        } catch (err) {
-          console.error('Error extracting image data for QR scanning:', err);
-          resolve(null);
-        }
-      };
+      img.onload = () => {};
       img.onerror = () => resolve(null);
       img.src = e.target?.result as string;

[NoCoverage] StringLiteral
src/lib/qr-utils.ts:131:39
         const canvas = document.createElement('canvas');
         canvas.width = img.width;
         canvas.height = img.height;
-        const ctx = canvas.getContext('2d');
+        const ctx = canvas.getContext("");
         if (!ctx) {
           resolve(null);

[NoCoverage] BlockStatement
src/lib/qr-utils.ts:132:19
         canvas.width = img.width;
         canvas.height = img.height;
         const ctx = canvas.getContext('2d');
-        if (!ctx) {
-          resolve(null);
-          return;
-        }
+        if (!ctx) {}
         ctx.drawImage(img, 0, 0);
         try {

[NoCoverage] ConditionalExpression
src/lib/qr-utils.ts:132:13
         canvas.width = img.width;
         canvas.height = img.height;
         const ctx = canvas.getContext('2d');
-        if (!ctx) {
+        if (false) {
           resolve(null);
           return;

[NoCoverage] BlockStatement
src/lib/qr-utils.ts:137:13
           return;
         }
         ctx.drawImage(img, 0, 0);
-        try {
-          const imageData = ctx.getImageData(0, 0, canvas.width, canvas.height);
-          const code = jsQR(imageData.data, imageData.width, imageData.height);
-          if (code) {
-            resolve(code.data);
-          } else {
-            resolve(null);
-          }
-        } catch (err) {
+        try {} catch (err) {
           console.error('Error extracting image data for QR scanning:', err);
           resolve(null);

[NoCoverage] ConditionalExpression
src/lib/qr-utils.ts:140:15
         try {
           const imageData = ctx.getImageData(0, 0, canvas.width, canvas.height);
           const code = jsQR(imageData.data, imageData.width, imageData.height);
-          if (code) {
+          if (false) {
             resolve(code.data);
           } else {

[NoCoverage] BlockStatement
src/lib/qr-utils.ts:140:21
         try {
           const imageData = ctx.getImageData(0, 0, canvas.width, canvas.height);
           const code = jsQR(imageData.data, imageData.width, imageData.height);
-          if (code) {
-            resolve(code.data);
-          } else {
+          if (code) {} else {
             resolve(null);
           }

[NoCoverage] BlockStatement
src/lib/qr-utils.ts:142:18
           const code = jsQR(imageData.data, imageData.width, imageData.height);
           if (code) {
             resolve(code.data);
-          } else {
-            resolve(null);
-          }
+          } else {}
         } catch (err) {
           console.error('Error extracting image data for QR scanning:', err);

[NoCoverage] BlockStatement
src/lib/qr-utils.ts:145:23
           } else {
             resolve(null);
           }
-        } catch (err) {
-          console.error('Error extracting image data for QR scanning:', err);
-          resolve(null);
-        }
+        } catch (err) {}
       };
       img.onerror = () => resolve(null);

[NoCoverage] StringLiteral
src/lib/qr-utils.ts:146:25
             resolve(null);
           }
         } catch (err) {
-          console.error('Error extracting image data for QR scanning:', err);
+          console.error("", err);
           resolve(null);
         }

[NoCoverage] ArrowFunction
src/lib/qr-utils.ts:150:21
           resolve(null);
         }
       };
-      img.onerror = () => resolve(null);
+      img.onerror = () => undefined;
       img.src = e.target?.result as string;
     };

[NoCoverage] ArrowFunction
src/lib/qr-utils.ts:153:22
       img.onerror = () => resolve(null);
       img.src = e.target?.result as string;
     };
-    reader.onerror = () => resolve(null);
+    reader.onerror = () => undefined;
     reader.readAsDataURL(file);
   });
